{
  "lessons": [
    {
      "id": "conic-sections",
      "title": "Introduction to Conic Sections",
      "objectives": [
        "Define conic sections and explain how they are formed by the intersection of a plane with a double-napped right circular cone.",
        "Identify and classify the four types of conic sections: circle, ellipse, parabola, and hyperbola, based on the angle and position of the intersecting plane.",
        "Describe key properties of conic sections, including focus, directrix, eccentricity, principal axis, and latus rectum.",
        "Apply the standard equations of conic sections to solve mathematical problems and graph their curves.",
        "Analyze real-world applications of conic sections, such as their use in planetary motion, optics, and engineering designs.",
        "Solve example problems involving conic sections, including determining equations given specific conditions (e.g., focus and eccentricity)."
      ],
      "content": [
        {
          "heading": "What are Conic Sections?",
          "body": "A conic section is a curve generated by intersecting a right circular cone with a plane. The vertex of the cone divides it into two nappes (upper and lower). Depending on the angle at which the plane intersects the cone, different curves such as circles, ellipses, parabolas, and hyperbolas are formed."
        },
        {
          "heading": "Conic Section Formulas",
          "body": "Different formulas apply to various conic sections. For example, the equation for a circle is x² + y² = a², for an ellipse it is x²/a² + y²/b² = 1, for a parabola one common form is y² = 4ax, and for a hyperbola, x²/a² – y²/b² = 1."
        },
        {
          "heading": "Focus, Eccentricity and Directrix",
          "body": "A conic section can be defined as the set of points P such that the ratio of the distance from P to the focus F and to the directrix d is constant (called the eccentricity, e). If e = 0 the conic is a circle; if 0 < e < 1 it is an ellipse; if e = 1 a parabola; and if e > 1 a hyperbola. One formula is e = cos α / cos β, where α is the angle of the cutting plane and β is the cone's angle."
        },
        {
          "heading": "Parameters of Conic Sections",
          "body": "Other key parameters include the principal axis (line joining the foci), linear eccentricity (distance from the center to a focus), latus rectum (a chord through the focus parallel to the directrix), and for ellipses the major and minor axes."
        },
        {
          "heading": "Sections of the Cone",
          "body": "When a plane cuts a cone, the following sections may form: a circle (if β = 90°), an ellipse (if α < β < 90°), a parabola (if α = β), or a hyperbola (if 0 ≤ β < α)."
        },
        {
          "heading": "Example Problem 1: Equation of an Ellipse",
          "body": "For an ellipse with foci at (±5, 0) and a major axis length of 14, the semi‑major axis a is 7 and c is 5. Since c² = a² – b², we have 25 = 49 – b², so b² = 24. The ellipse equation is: x²/49 + y²/24 = 1."
        },
        {
          "heading": "Example Problem 2: Focus and Directrix of a Parabola",
          "body": "For the parabola y² = 12x, compare with y² = 4ax to find a = 3. Thus, the focus is at (3, 0) and the directrix is the line x = –3."
        }
      ],
      "resources": [
        {
          "title": "Graphing Calculator (GeoGebra)",
          "url": "https://www.geogebra.org/graphing"
        },
        {
          "title": "Conic Sections Video Tutorial",
          "url": "https://youtu.be/PLrgwD9TleU?si=ACbaiGepRl5DaF9e"
        }
      ]
    },
    {
      "id": "introduction-to-circles",
      "title": "Introduction to Circles",
      "objectives": [
        "Define a circle and identify its key components.",
        "Understand the relationships between the radius, diameter, and circumference.",
        "Calculate the circumference and area of a circle using appropriate formulas."
      ],
      "content": [
        {
          "heading": "What is a Circle?",
          "body": "A circle is a special shape in math and geometry. It is a perfectly round figure where every point on its outline is the same distance from the center. This fixed distance is called the radius. The diameter is a straight line that passes through the center and touches both sides of the circle. It is always twice the length of the radius."
        },
        {
          "heading": "Circle Definition",
          "body": "A circle is a closed two-dimensional figure in which the set of all the points in the plane is equidistant from a given point called the ‘centre’. The formula for a circle is (x-h)² + (y-k)² = r², where (x, y) are the coordinates of any point on the circle, (h, k) is the centre's coordinates, and r is the radius."
        },
        {
          "heading": "Parts of a Circle",
          "body": "A circle has various parts based on its geometry. These include the annulus, arc, sector, segment, centre, chord, diameter, radius, secant, and tangent."
        },
        {
          "heading": "Radius and Diameter",
          "body": "The radius is a line segment connecting the centre of the circle to any point on the circle. The diameter is a straight line passing through the centre of the circle and touching the circle at two points. It is twice the length of the radius."
        },
        {
          "heading": "Circle Formulas",
          "body": "The two important measurements for a circle are its area and circumference. The formulas are: Circumference = 2πr and Area = πr²."
        },
        {
          "heading": "Understanding the Proof of the Circle's Area",
          "body": "The area of a circle can be derived by imagining the circle as many thin rings (or layers) and arranging them into a right-angled triangle. The base of this triangle is the circumference (2πr), and the height is the radius (r). Using the area of a triangle (½ × base × height), we get the formula for the area of a circle: A = πr²."
        },
        {
          "heading": "Example Problems",
          "body": "Example 1: Find the area and circumference of a circle with a radius of 10 cm. Using the formulas: Area = πr² = 3.14 × 10² = 314 cm², Circumference = 2πr = 2 × 3.14 × 10 = 62.8 cm.\n\nExample 2: Given the circumference of a circle is 31.4 cm, find the area. First, calculate the radius (r = 5 cm), then use the formula A = πr² to find the area: A = 3.14 × 5² = 78.5 cm²."
        }
      ],
      "resources": [
        {
          "title": "Graphing Calculator (GeoGebra)",
          "url": "https://www.geogebra.org/graphing"
        },
        {
          "title": "Circle Formulas Video Tutorial",
          "url": "https://youtu.be/PLrgwD9TleU"
        }
      ]
    },
    {
      "id": "General-to-Standard-Form-of-Trinomial-Form",
      "title": "General to Standard Form of Trinomial Form",
      "objectives": [
        "Define the general form and standard form of a trinomial.",
        "Convert a trinomial from general form to standard form using completing the square.",
        "Identify the vertex of a quadratic function in standard form.",
        "Apply the concept to solve problems and interpret quadratic graphs."
      ],
      "content": {
        "trinomial": {
          "definition": "A trinomial is a type of polynomial that consists of three terms. The most common form of a trinomial is a quadratic trinomial, which can be written in the general form: ax² + bx + c, where a is the coefficient of x² (must not be zero), b is the coefficient of x, and c is the constant term.",
          "standard_form": "The standard form (also called vertex form) of a quadratic trinomial is: a (x - h)² + k, where (h, k) is the vertex of the parabola, and a is the same coefficient as in the general form."
        },
        "steps_to_convert": [
          {
            "step": "Step 1: Factor out 'a' from the first two terms (if necessary)",
            "example": "Convert 2x² + 8x + 5 to standard form: Factor out 2 from the first two terms: 2(x² + 4x) + 5"
          },
          {
            "step": "Step 2: Complete the Square",
            "example": "Take the coefficient of x (4), divide by 2: 4 ÷ 2 = 2. Square the result: 2² = 4. Add and subtract this value inside the parentheses: 2(x² + 4x + 4 - 4) + 5."
          },
          {
            "step": "Step 3: Rewrite as a Perfect Square",
            "example": "The first three terms now form a perfect square trinomial: 2((x + 2)² - 4) + 5."
          },
          {
            "step": "Step 4: Distribute the 'a' and Simplify",
            "example": "Distribute 2 to -4 and simplify: 2(x + 2)² - 8 + 5 = 2(x + 2)² - 3."
          }
        ],
        "general_formula": {
          "formula": "a(x - h)² + k",
          "h": "-b / 2a",
          "k": "c - (b² / 4a)"
        },
        "example_problems": [
          {
            "problem": "Example 1: Convert x² - 6x + 8 to standard form",
            "steps": [
              "Step 1: Identify a = 1, b = -6, c = 8.",
              "Step 2: Take b/2, square it: (-6/2)² = (-3)² = 9. Add and subtract 9 inside parentheses: (x² - 6x + 9) - 9 + 8.",
              "Step 3: Rewrite as a perfect square: (x - 3)² - 1.",
              "Final Answer: (x - 3)² - 1."
            ]
          },
          {
            "problem": "Example 2: Convert 3x² + 12x + 7 to standard form",
            "steps": [
              "Step 1: Factor out 3: 3(x² + 4x) + 7.",
              "Step 2: Complete the square inside parentheses: (4/2)² = 2² = 4. Add and subtract 4: 3(x² + 4x + 4 - 4) + 7.",
              "Step 3: Distribute and simplify: 3(x + 2)² - 12 + 7 = 3(x + 2)² - 5.",
              "Final Answer: 3(x + 2)² - 5."
            ]
          }
        ]
      },
      "note": "The general form is ax² + bx + c. The standard form (vertex form) is a(x - h)² + k. To convert, complete the square: 1. Factor out a (if necessary). 2. Find (b/2)², add and subtract it inside parentheses. 3. Rewrite as a squared binomial. 4. Distribute and simplify. Standard form makes it easier to find the vertex, graph, and analyze transformations."
    },
    {
      "id": "Parabola",
      "title": "Parabola",
      "objectives": [
        "Learn the geometric definition of a parabola",
        "Learn how to find the focus of a parabola",
        "Learn how to find the directrix of a parabola",
        "Learn how to write the equation of a parabola",
        "Learn how to find the latus rectum of a parabola"
      ],
      "content": {
        "parabola": {
          "definition": "A parabola is the set of all points in a plane equidistant from a fixed point, known as the focus, and a fixed line, known as the directrix. The axis of symmetry will pass through the focus and is perpendicular to the directrix. The point of intersection of the parabola with its axis of symmetry is known as its vertex. Additionally, the vertex is the midpoint of the line segment that joins the focus and directrix on the axis of symmetry.",
          "types": [
            {
              "type": "Vertical Parabola",
              "vertex_formula": "y = a(x - h)² + k",
              "vertex_form": "If a > 0, the parabola opens up; If a < 0, the parabola opens down; The vertex occurs at (h, k); Axis of symmetry: x = h"
            },
            {
              "type": "Horizontal Parabola",
              "vertex_formula": "x = a(y - k)² + h",
              "vertex_form": "If a > 0, the parabola opens right; If a < 0, the parabola opens left; The vertex occurs at (h, k); Axis of symmetry: y = k"
            }
          ]
        },
        "focus_and_directrix": {
          "focus": "The focus is a fixed point on the axis of symmetry. For a vertical parabola, it is at (h, k + p), and for a horizontal parabola, it is at (h + p, k).",
          "directrix": "The directrix is a fixed line parallel to the axis of symmetry. For a vertical parabola, it is y = k - p, and for a horizontal parabola, it is x = h - p."
        },
        "equations": [
          {
            "type": "Vertical Parabola with Vertex at the Origin",
            "equation": "x² = 4py",
            "description": "If the parabola has its vertex at the origin and opens upwards or downwards, its equation will be x² = 4py. If p > 0, the parabola opens upwards. If p < 0, the parabola opens downwards."
          },
          {
            "type": "Horizontal Parabola with Vertex at the Origin",
            "equation": "y² = 4px",
            "description": "If the parabola has its vertex at the origin and opens to the left or right, its equation will be y² = 4px. If p > 0, the parabola opens to the right. If p < 0, the parabola opens to the left."
          }
        ],
        "example_problems": [
          {
            "problem": "Example #1: Find the focus and directrix of the parabola x² = -1/2y.",
            "steps": [
              "Multiply both sides by -1/2 to get x² = 4py.",
              "Identify p = -1/8.",
              "The focus is (0, -1/8), and the directrix is y = 1/8."
            ]
          },
          {
            "problem": "Example #2: Find the focus and directrix of the parabola x = 1/6 y².",
            "steps": [
              "Rewrite the equation as y² = 6x.",
              "Compare with y² = 4px to find p = 3/2.",
              "The focus is (3/2, 0), and the directrix is x = -3/2."
            ]
          },
          {
            "problem": "Example #3: Write an equation for the vertical parabola with vertex (0, 0) passing through point (5, 5).",
            "steps": [
              "Use the equation x² = 4py and plug in the point (5, 5).",
              "Solve for p: p = 5/4.",
              "The equation is x² = 5y, with the focus (0, 5/4) and directrix y = -5/4."
            ]
          }
        ]
      }
    },
    {
      "lesson_title": "HYPERBOLA",
      "objectives": [
        "Locate a hyperbola’s vertices and foci.",
        "Write equations of hyperbolas in standard form.",
        "Graph hyperbolas centered at the origin.",
        "Graph hyperbolas not centered at the origin.",
        "Solve applied problems involving hyperbolas."
      ],
      "introduction": {
        "description": "The paths of comets, the shock waves of supersonic booms, the design of ancient Greek pillars, and the shape of natural draft cooling towers all have something in common—they can be represented by the same type of conic section. For example, when an object moves faster than sound, it creates a cone-shaped shock wave. When this wave meets the ground, it forms a specific conic shape, which results in a sonic boom.",
        "figure": {
          "figure_number": "12.2.112.2.1",
          "caption": "A shock wave intersecting the ground forms a portion of a conic and results in a sonic boom."
        },
        "additional_info": "Many people know about the sonic boom caused by supersonic planes, but humans have been breaking the sound barrier long before the first supersonic flight. A whip makes a cracking sound because its tip moves faster than the speed of sound. Similarly, bullets from many firearms travel at supersonic speeds, though the loud bang of the gun often drowns out the sound of the sonic boom."
      },
      "locating_vertices_and_foci": {
        "description": "A hyperbola is a conic section formed by intersecting a right circular cone with a plane at an angle such that both halves of the cone are intersected. This intersection produces two separate unbounded curves that are mirror images of each other.",
        "figure": {
          "figure_number": "12.2.212.2.2",
          "caption": "A hyperbola"
        },
        "definition": "A hyperbola is made up of all points (x,y) where the difference between their distances from two fixed points, called foci, is always the same positive number. The main difference between a hyperbola and an ellipse is how they are defined—an ellipse is based on the sum of distances from the foci, while a hyperbola is based on the difference of distances.",
        "axes_of_symmetry": {
          "transverse_axis": "Runs through the center and connects the two vertices. The foci are also along this axis.",
          "conjugate_axis": "Perpendicular to the transverse axis and connects the co-vertices."
        },
        "center": "The point where the two axes meet.",
        "asymptotes": "A hyperbola has two asymptotes, which are diagonal lines passing through the center. As the hyperbola extends outward, its branches get closer and closer to these asymptotes but never actually touch them."
      },
      "graphing_a_hyperbola": {
        "central_rectangle": "To help graph a hyperbola, we use a central rectangle, which is centered at the origin. The sides of this rectangle pass through the vertices and co-vertices. To draw the asymptotes, simply extend the diagonals of this rectangle.",
        "figure": {
          "figure_number": "12.2.312.2.3",
          "caption": "Key features of the hyperbola"
        },
        "discussion": "We will limit our discussion to hyperbolas that are positioned vertically or horizontally in the coordinate plane; the axes will either lie on or be parallel to the x- and y-axes. We will consider two cases: those that are centered at the origin, and those that are centered at a point other than the origin."
      },
      "equation_of_hyperbola_centered_at_origin": {
        "formula": "The equation defines a hyperbola centered at the origin with vertices (±a,0) and co-vertices (0,±b).",
        "standard_forms": {
          "horizontal_hyperbola": {
            "equation": "x²/a² - y²/b² = 1",
            "features": {
              "transverse_axis": "2a",
              "vertices": "(±a,0)",
              "conjugate_axis": "2b",
              "co_vertices": "(0,±b)",
              "distance_between_foci": "2c, where c² = a² + b²",
              "foci": "(±c,0)",
              "asymptotes": "y = ±b/a * x"
            }
          },
          "vertical_hyperbola": {
            "equation": "y²/a² - x²/b² = 1",
            "features": {
              "transverse_axis": "2a",
              "vertices": "(0,±a)",
              "conjugate_axis": "2b",
              "co_vertices": "(±b,0)",
              "distance_between_foci": "2c, where c² = a² + b²",
              "foci": "(0,±c)",
              "asymptotes": "y = ±a/b * x"
            }
          }
        }
      },
      "finding_asymptotes": {
        "description": "To sketch the asymptotes, extend the diagonals of the central rectangle.",
        "equations_of_asymptotes": {
          "horizontal_hyperbola": "y = ±b/a * x",
          "vertical_hyperbola": "y = ±a/b * x"
        }
      },
      "equation_of_hyperbola_centered_at_hk": {
        "standard_form_horizontal": {
          "equation": "(x-h)²/a² - (y-k)²/b² = 1",
          "features": {
            "transverse_axis": "2a",
            "vertices": "(h, k ± a)",
            "conjugate_axis": "2b",
            "co_vertices": "(h ± b, k)",
            "distance_between_foci": "2c, where c² = a² + b²",
            "foci": "(h, k ± c)",
            "asymptotes": "y - k = ±b/a * (x - h)"
          }
        },
        "standard_form_vertical": {
          "equation": "(y-k)²/a² - (x-h)²/b² = 1",
          "features": {
            "transverse_axis": "2a",
            "vertices": "(h, k ± a)",
            "conjugate_axis": "2b",
            "co_vertices": "(h ± b, k)",
            "distance_between_foci": "2c, where c² = a² + b²",
            "foci": "(h, k ± c)",
            "asymptotes": "y - k = ±a/b * (x - h)"
          }
        }
      },
      "sample_problems": [
        {
          "title": "Identifying Key Features of a Hyperbola",
          "problem": "Given the equation of a hyperbola, find the center, transverse and conjugate axes, vertices, foci, and equations of the asymptotes.",
          "solution": [
            "Center: (2, -3)",
            "Transverse axis: Horizontal",
            "Conjugate axis: Vertical",
            "Vertices: (-2, -3) and (6, -3)",
            "Foci: (-3, -3) and (7, -3)",
            "Asymptotes: y = ±2/3 * (x - 2)"
          ]
        },
        {
          "title": "Writing the Equation of a Hyperbola",
          "problem": "Write the equation of a hyperbola that has center at (0,0), vertices at (0, ±6), and foci at (0, ±10).",
          "solution": [
            "Determine if the hyperbola is horizontal or vertical: Vertical hyperbola.",
            "Find a²: a = 6, so a² = 36.",
            "Find c² and solve for b²: c = 10, so 100 = 36 + b², b² = 64.",
            "Write the final equation: y²/36 - x²/64 = 1."
          ]
        }
      ]
    }
  ]
}
